In [1]:
import pandas as pd

In [2]:
people = {
    "first": ['John', 'Jane', 'Joe'],
    "last": ['Doe', 'Doe', 'Rogan'],
    "email": ['johnDoe@email.com', 'janeDoe@email.com', 'joeRogan@email.com']
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

  first   last               email
0  John    Doe   johnDoe@email.com
1  Jane    Doe   janeDoe@email.com
2   Joe  Rogan  joeRogan@email.com

### Add a Column

Let's create a new column called `full_name` that comprises of `first` and `last` columns.

In [5]:
df["full_name"] = df["first"] + " " + df["last"]

In [6]:
df

  first   last               email  full_name
0  John    Doe   johnDoe@email.com   John Doe
1  Jane    Doe   janeDoe@email.com   Jane Doe
2   Joe  Rogan  joeRogan@email.com  Joe Rogan

### Drop a Column

Let's now drop the `first` and `last` columns

In [7]:
df.drop(columns=['first', 'last'])

                email  full_name
0   johnDoe@email.com   John Doe
1   janeDoe@email.com   Jane Doe
2  joeRogan@email.com  Joe Rogan

`DataFrame.drop` requires `inplace` = `True` to apply its changes to the original data.

In [8]:
df.drop(columns=['first', 'last'], inplace=True)

In [9]:
df

                email  full_name
0   johnDoe@email.com   John Doe
1   janeDoe@email.com   Jane Doe
2  joeRogan@email.com  Joe Rogan

### Split a Column into several columns

Now let's try to split `full_name` column into two columns again.

In [10]:
df['full_name'].str.split(" ")

0     [John, Doe]
1     [Jane, Doe]
2    [Joe, Rogan]
Name: full_name, dtype: object

The method `split` from `str` class splited `full_name` column entries on " " delimeter into lists of two strings. To assign each string from each row to a seperate column we add the argument `expand=True` to `str.split` method

In [11]:
df

                email  full_name
0   johnDoe@email.com   John Doe
1   janeDoe@email.com   Jane Doe
2  joeRogan@email.com  Joe Rogan

In [12]:
df['full_name'].str.split(" ", expand=True)

      0      1
0  John    Doe
1  Jane    Doe
2   Joe  Rogan

As we see the columns are indexed by numbers by default.

now we can assign these columns that resulted from `full_name` split, to new columns names in the `df` `DataFrame`.

In [13]:
df[['first', 'last']] = df['full_name'].str.split(" ", expand=True)

In [14]:
df

                email  full_name first   last
0   johnDoe@email.com   John Doe  John    Doe
1   janeDoe@email.com   Jane Doe  Jane    Doe
2  joeRogan@email.com  Joe Rogan   Joe  Rogan

### Add a Row

To add a row, we use the `DataFrame` method `.append` and pass to it the data of the new row in a shape of a `dictionary` where keys represent columns and values represent the  value of the new row entry.    
__example:-__     
let's imagine that we want to add a new row with a first name `first` = "Tony", and no values for `last` and `email`.

In [15]:
df.append({"first": "Tony"})

TypeError: Can only append a dict if ignore_index=True

we got an `Error` because as the Error message explains, when appending a row to a DataFrame using a dictionary, indexing matters, and it is important to set the argument `ignore_index=True`

In [16]:
df.append({"first": "Tony"}, ignore_index=True)

                email  full_name first   last
0   johnDoe@email.com   John Doe  John    Doe
1   janeDoe@email.com   Jane Doe  Jane    Doe
2  joeRogan@email.com  Joe Rogan   Joe  Rogan
3                 NaN        NaN  Tony    NaN

As we see, the values that have not been entered have been set to "NaN" by default.

### Add Rows by appending another DataFrame to the end of the DataFrame at hand

First let's create another `DataFrame`

In [17]:
people = {
    "first": ["Tony", "Steve"],
    "last": ["Stark", "Rogers"],
    "email": ["IronMan@avenge.com", "Cap@avenge.com"]
}

df2 = pd.DataFrame(people)

In [18]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

`df.append(df2)` appends `df2` to the end of `df`

In [19]:
df.append(df2)

                email  full_name  first    last
0   johnDoe@email.com   John Doe   John     Doe
1   janeDoe@email.com   Jane Doe   Jane     Doe
2  joeRogan@email.com  Joe Rogan    Joe   Rogan
0  IronMan@avenge.com        NaN   Tony   Stark
1      Cap@avenge.com        NaN  Steve  Rogers

Do not forget to set `ignore_index`=`True` to activate automatic indexing.

In [20]:
df.append(df2, ignore_index=True)

                email  full_name  first    last
0   johnDoe@email.com   John Doe   John     Doe
1   janeDoe@email.com   Jane Doe   Jane     Doe
2  joeRogan@email.com  Joe Rogan    Joe   Rogan
3  IronMan@avenge.com        NaN   Tony   Stark
4      Cap@avenge.com        NaN  Steve  Rogers

`DataFrame.append` does not have inplace argument to apply its changes on original data permenantly, therefore we have to set these changes by assigning the variable of the DataFrame at hand, to the append procedure.

In [21]:
df

                email  full_name first   last
0   johnDoe@email.com   John Doe  John    Doe
1   janeDoe@email.com   Jane Doe  Jane    Doe
2  joeRogan@email.com  Joe Rogan   Joe  Rogan

In [22]:
df = df.append(df2, ignore_index=True)

In [23]:
df

                email  full_name  first    last
0   johnDoe@email.com   John Doe   John     Doe
1   janeDoe@email.com   Jane Doe   Jane     Doe
2  joeRogan@email.com  Joe Rogan    Joe   Rogan
3  IronMan@avenge.com        NaN   Tony   Stark
4      Cap@avenge.com        NaN  Steve  Rogers

### Remove a Row

To remove a row, we use the same `DataFrame` method `.drop` but instead of using `columns` argument we use `index` argument.    
__example:-__     
Let's consider dropping the last row.

In [24]:
df.drop(index=4, inplace=True)

In [25]:
df

                email  full_name first   last
0   johnDoe@email.com   John Doe  John    Doe
1   janeDoe@email.com   Jane Doe  Jane    Doe
2  joeRogan@email.com  Joe Rogan   Joe  Rogan
3  IronMan@avenge.com        NaN  Tony  Stark

### Drop multiple rows using conditionals

we use the same method `DataFrame.drop` with `index`= `[list of indexes]` argument but we pass to it (`index`) a list of generated indexes based on a conditional.     
__example:-__    
Let's consider dropping the rows that have `'Doe'` as a value in `last` column.

In [26]:
_filter = (df['last'] == 'Doe')

In [27]:
df.drop(index=df[_filter].index)

                email  full_name first   last
2  joeRogan@email.com  Joe Rogan   Joe  Rogan
3  IronMan@avenge.com        NaN  Tony  Stark

In [28]:
df

                email  full_name first   last
0   johnDoe@email.com   John Doe  John    Doe
1   janeDoe@email.com   Jane Doe  Jane    Doe
2  joeRogan@email.com  Joe Rogan   Joe  Rogan
3  IronMan@avenge.com        NaN  Tony  Stark

In [29]:
df.drop(index=df[_filter].index, inplace=True)

In [30]:
df

                email  full_name first   last
2  joeRogan@email.com  Joe Rogan   Joe  Rogan
3  IronMan@avenge.com        NaN  Tony  Stark